shuishen-cang/chibios_gd32e507/cfg/drv_usb_regs.h
#define GRXSTS_PKTSTS_IN                        2U
#define GRXSTS_PKTSTS_IN_XFER_COMP              3U
#define GRXSTS_PKTSTS_DATA_TOGGLE_ERR           5U
#define GRXSTS_PKTSTS_CH_HALTED                 7U

#define DEVICE_MODE                             0U                      /*!< device mode */
#define HOST_MODE                               1U                      /*!< host mode */
#define OTG_MODE                                2U                      /*!< OTG mode */

#define HCTL_30_60MHZ                           0U                      /*!< USB clock 30-60MHZ */
#define HCTL_48MHZ                              1U                      /*!< USB clock 48MHZ */
#define HCTL_6MHZ                               2U                      /*!< USB clock 6MHZ */

enum USB_SPEED {
    USB_SPEED_UNKNOWN = 0,                                              /*!< USB speed unknown */
    USB_SPEED_LOW,                                                      /*!< USB speed low */
    USB_SPEED_FULL,                                                     /*!< USB speed full */
    USB_SPEED_HIGH                                                      /*!< USB speed high */
};

#define EP0_OUT                                 ((uint8_t)0x00U)        /*!< endpoint out 0 */
#define EP0_IN                                  ((uint8_t)0x80U)        /*!< endpoint in 0 */
#define EP1_OUT                                 ((uint8_t)0x01U)        /*!< endpoint out 1 */
#define EP1_IN                                  ((uint8_t)0x81U)        /*!< endpoint in 1 */
#define EP2_OUT                                 ((uint8_t)0x02U)        /*!< endpoint out 2 */
#define EP2_IN                                  ((uint8_t)0x82U)        /*!< endpoint in 2 */
#define EP3_OUT                                 ((uint8_t)0x03U)        /*!< endpoint out 3 */
#define EP3_IN                                  ((uint8_t)0x83U)        /*!< endpoint in 3 */
#define EP4_OUT                                 ((uint8_t)0x04U)        /*!< endpoint out 4 */
#define EP4_IN                                  ((uint8_t)0x84U)        /*!< endpoint in 4 */
#define EP5_OUT                                 ((uint8_t)0x05U)        /*!< endpoint out 5 */
#define EP5_IN                                  ((uint8_t)0x85U)        /*!< endpoint in 5 */

#endif /* __DRV_USB_REGS_H */
